Revit 2026 API

# TransformOfPoint Method

---

Applies the transformation to the point and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ OfPoint(
	XYZ point
)
```
```vb
Public Function OfPoint (
	point As XYZ
) As XYZ
```
```cpp
public:
XYZ^ OfPoint(
	XYZ^ point
)
```
```fsharp
member OfPoint :
        point : XYZ -> XYZ
```

#### Parameters

point XYZ
    The point to transform.

#### Return Value

XYZThe transformed point.

Transformation of a point is affected by the translational part of the transformation.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace